# UsedInSizeLists Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSize..::..UsedInSizeLists Property
MEPSize Class See Also
---
Whether it is used in size lists.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool UsedInSizeLists { get; }
```

Visual Basic
---
```text
Public ReadOnly Property UsedInSizeLists As Boolean
	Get
```

Visual C++
---
```text
public:
property bool UsedInSizeLists {
	bool get ();
}
```

# See Also
MEPSize Class
Autodesk.Revit.DB Namespace